{"pages":[],"posts":[{"title":"CVTE后台面经","text":"3.8一面 介绍下项目 纸上画一下两个项目的架构，讲下为什么从集中式改进为分布式，讲下两种架构的优缺点 算法题： 给定一个整形数组，要求利用所有元素拼出最大的整数（剑指Offer最小整数变题）未搞定 简单的递归问题 主从复制实现原理 读写分离除了中间件外还有什么实现方式？讲了Spring AOP动态切换数据源 讲下Spring AOP，底层实现是什么，java动态代理与CGlib动态代理的区别 最近有什么学习的计划么 mysql的有哪些引擎，熟悉它们之间的区别吗 mysql索引了解吗？实现原理？ 3.8二面 介绍下你的项目？ 讲下你的kaggle比赛 打印1000以内的素数（只想到了最简单的，没想到素数筛） 项目在高并发情况下改进的思路？讲了下页面静态化，kafuka Redis用来存了哪些数据？常用的数据结构有哪些？ 讲下sql的查询优化？讲了索引、分库分表以及在项目中的运用，慢查询日志、explain、profile等 jvm的内容是看的书吗？有进行过JVM的调优吗？ 为什么使用dubbo呢，了解过spring cloud吗？ 关于dubbo服务的问题，如果服务链上一个服务出错了，如何排查 近期的学习计划 谈下自己的职业规划 3.10 HR面 对前天的面试表现进行评价 介绍下家庭和父母的情况，父母的性格，你的性格像谁 讲一件你很努力的去做，却没有做好的事。如果再给你去做，你会怎么做？ 讲一件你印象最深的事情 什么时候是你压力最大的时候 父母对你工作的要求，对你的期望 讲下你的理想 讲下你对去广州工作的看法、对于加班、对于薪资的看法 还有什么想问的吗 总结这是第一次参与技术面试，并且是现场面，还是相当紧张的，尤其是当面手撕算法的时候。在技术上我应该加强这些方面： 加强主从复制，以及读写分离的实践 加强动态代理模式以及AOP的底层实现 加强框架底层源码的理解 基础算法有待加强","link":"/2019/05/26/CVTE后台面经/"},{"title":"作业帮后台面经","text":"4.12 视频一面 自我介绍 读写分离怎么做的？讲了以前用的mysql proxy，以及现在的动态代理动态切换数据源 Redis是怎么用的，了解多少？讲了架构，数据类型，常见问题 Redis有哪些用途，介绍下？ 算法题：2元钱可以买一瓶啤酒，每两个啤酒瓶可以换一瓶啤酒，每四个啤酒盖可以换一瓶啤酒，问现有x元最多可以喝多少啤酒？ 递归问题，以空啤酒瓶数和啤酒瓶盖数来做递归当两者同时不满足条件时终止递归 已知前中序，求后序 TCP的三次握手、四次挥手 常见HTTP状态码：404（页面未找到），302（临时重定向） 4.15 视频二面 自我介绍 分别讲下参加的比赛做的内容？是团队参赛吗？团队规模以及如何分工？ 海量数据TOP K的问题：现有海量的日志，每条日志中涉及访问的URL和访问IP，先要求出访问量前10的URL地址 本人给了hash映射+hash表计数+排序，排序的话一开始讲了堆排序（小顶堆），面试官不满意，然后又讲了优化的快排来解决TOP K，面试官表示想要O(n)的TOP K解法，原谅我这个菜鸡是在是不知，然后果断回复，不知道了。。。 给一个初始是递增的数组，在中间某个位置随机断开，这样就形成了类似5，6，7，8，9，10，1，2，3，4，5这样的数组，现要以O(logn)的效率找到其中一个数。（Leetcode原题 33 搜索旋转排序数组） 基本思路是二分，因为查找中除开数据结构（例如：搜索树、跳表）外，能达到logn的只有二分。首先拿新数组的中间值与数组的头尾比较，若中间值大于头，则说明左半部分是有序的，接下来比较target与中间值的关系，这就是二分的思想了。同理，若一开始中间值小于头，说明右半部分是有序的，接下来还是比较target与中间值，进行二分。 总结作业帮后端的主语言是Php，因此在面试考察内容也是数据库和算法居多。视频面手撕代码的注意点： 编码过程中一定要展现出自己良好的编程习惯，例如：变量命名以及注释等 事先在牛客等平台进行视频面试的代码练习 云端的Code环境通常没有代码提示，因此需要记住常用的类所在的位置","link":"/2019/05/26/作业帮后台面经/"},{"title":"东方财富后台面经","text":"技术面 3.28现场 读写分离是不在代码层面实现吗？ redis集群的规模？ redis层面做了数据切片吗？ 代码层如何减少gc？ 如何实现异步接口？ 多线程这块了解吗？如何给代码加锁？ 如何实现一个自己的线程池？ 设计模式了解？ 通信框架了解吗？像netty？ es了解吗？ 算法比赛有参加过吗？ 有什么需要了解的吗？HR面 3.28现场 实习是怎么打算的呢？ 现在有offer吗，近期有再找其他的吗？ 你的职业规划呢？ 做项目的过程中有遇到什么难点吗？是如何解决的？老师和同学的对你的评价如何？ 对于自己的缺点，或者说需要改进的地方？ 对证券公司了解吗？答不了解，小姐姐巴拉巴拉介绍了一大堆 对于薪资的要求呢？ 总结东方财富的面试相对比较简单，技术就一轮面试。但这个过程中也get到一些自己薄弱的点，如下： 设计模式 线程池的原理，以及Java高并发相关的知识","link":"/2019/05/26/东方财富后台面经/"}],"tags":[{"name":"后台面经","slug":"后台面经","link":"/tags/后台面经/"},{"name":"Java","slug":"Java","link":"/tags/Java/"},{"name":"实习","slug":"实习","link":"/tags/实习/"},{"name":"CVTE","slug":"CVTE","link":"/tags/CVTE/"},{"name":"作业帮","slug":"作业帮","link":"/tags/作业帮/"},{"name":"东方财富","slug":"东方财富","link":"/tags/东方财富/"}],"categories":[{"name":"面经","slug":"面经","link":"/categories/面经/"}]}